# SyncMatrixToBound

## Description
Synchronize the object's matrix with the specified story bound.

```pascal
PROCEDURE SyncMatrixToBound(
				object  : HANDLE;
				BoundID : INTEGER);
```

```python

def vs.SyncMatrixToBound(object, BoundID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object handle.|
|BoundID|INTEGER|The identifier of the story bound.|

## Version
Availability: from Vectorworks 2013
## Category
* Objects - Architectural